In [1]:
import pandas as pd
import numpy as np

In [10]:
pop = {'Nevada' : {2001 : 2.4, 2002 : 2.9},
      'Ohio' : {200 : 1.5, 2001 : 1.7, 2002 : 3.6}}

In [11]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {200: 1.5, 2001: 1.7, 2002: 3.6}}

In [12]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [29]:
frame3 = pd.DataFrame(pop)

In [30]:
frame3

      Nevada  Ohio
200      NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [31]:
data1 = { 'Ohio' : frame3['Ohio'][:-1],
        'Nevada' : frame3['Nevada'][:2]}

In [32]:
data1

{'Ohio': 200     1.5
 2001    1.7
 Name: Ohio, dtype: float64, 'Nevada': 200     NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [33]:
pd.DataFrame(data1)

      Ohio  Nevada
200    1.5     NaN
2001   1.7     2.4

In [37]:
frame3.index.name = 'year'
frame3.columns.name = 'states'

In [38]:
frame3

states  Nevada  Ohio
year
200        NaN   1.5
2001       2.4   1.7
2002       2.9   3.6

In [40]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [41]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [42]:
index = obj.index

In [43]:
index

Index(['a', 'b', 'c'], dtype='object')

In [44]:
index[1:]

Index(['b', 'c'], dtype='object')

In [50]:
labels = pd.Index(np.arange(3))

In [51]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [53]:
'Ohio' in frame3

True

In [54]:
2001 in frame3

False

In [72]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [73]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [74]:
obj3.reindex(range(10), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
6    yellow
7    yellow
8    yellow
9    yellow
dtype: object

In [81]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'], columns=[ 'Ohio', 'Texas', 'California'])

In [82]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

# Dropping Entries from an axes

In [84]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['ohio', 'texas', 'colirado', 'utha'],
                   columns=['one', 'two', 'three', 'four'])

In [85]:
data

          one  two  three  four
ohio        0    1      2     3
texas       4    5      6     7
colirado    8    9     10    11
utha       12   13     14    15

In [86]:
data.drop('texas')

          one  two  three  four
ohio        0    1      2     3
colirado    8    9     10    11
utha       12   13     14    15

In [93]:
data.drop(['texas', 'utha'])

          one  two  three  four
ohio        0    1      2     3
colirado    8    9     10    11

In [95]:
# data.drop(['two', 'four'])

# Indexing Slicing and Selection

In [96]:
data

          one  two  three  four
ohio        0    1      2     3
texas       4    5      6     7
colirado    8    9     10    11
utha       12   13     14    15

In [97]:
data['ohio':'colirado']

          one  two  three  four
ohio        0    1      2     3
texas       4    5      6     7
colirado    8    9     10    11

In [111]:
# data['two' : 'three']['ohio']

In [112]:
# data['two' : 'three']['ohio' : 'colirado']

In [113]:
data[data['three'] > 5]

          one  two  three  four
texas       4    5      6     7
colirado    8    9     10    11
utha       12   13     14    15

In [114]:
data < 5

            one    two  three   four
ohio       True   True   True   True
texas      True  False  False  False
colirado  False  False  False  False
utha      False  False  False  False

In [115]:
data.loc['colirado', ['two', 'three']]

two       9
three    10
Name: colirado, dtype: int32

In [116]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: colirado, dtype: int32

In [117]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
texas        7    4    5
colirado    11    8    9

In [118]:
data.loc[: 'utha', 'two']

ohio         1
texas        5
colirado     9
utha        13
Name: two, dtype: int32

In [123]:
data.iloc[:, :3][data.three > 5]

          one  two  three
texas       4    5      6
colirado    8    9     10
utha       12   13     14

In [125]:
np.nan

nan

In [126]:
np.NAN

nan

In [129]:
x = 10
y = 12
z = 13
print(x, y, z, 89)

10 12 13 89

In [130]:
x = 'a'
b = 'b'
z = 'p'
print(x, b, z)

a b p

In [131]:
# lambda function

In [135]:
f = lambda x: x*100

In [136]:
f(3)

300

In [137]:
f(9)

900